// pages/warranty-and-returns.tsx
import { CrumbsLink } from "@/components/parts/CrumbsLink";
import { NextPage } from "next";

const WarrantyAndReturns: NextPage = () => {
  const crumbsData = {
    categories: {
      id: null,
      category: {
        name: "Гарантія та Повернення",
      },
    },
    items: [],
  };

  return (
    <div className="bg-gray-100 min-h-screen p-4">
      <CrumbsLink categories={crumbsData.categories} items={crumbsData.items} />
      <div className="max-w-4xl mx-auto bg-white p-6 rounded-lg shadow-md">
        <div className="mb-8">
          <h2 className="text-xl font-semibold mb-4">Гарантія та Повернення</h2>
          <p>
            Усі товари на нашому сайті мають офіційну гарантію від виробника.
            Гарантійний термін на меблі, що купували у нас, становить 12
            місяців, якщо не було вказано інше.
          </p>
          <p>
            Підтвердження гарантійних зобов'язань покупці отримують талон на
            обслуговування або гарантійний лист від інтернет-магазину "Тера
            Меблі".
          </p>
          <p>
            Покупці повинні перевірити цілісність свого замовлення при отриманні
            товарів. У разі пошкодження наявність акту приймання-інспекції
            обов'язкова.
          </p>
        </div>

        <div className="mb-8">
          <h3 className="text-xl font-semibold mb-4">При самостійній збірці</h3>
          <p className="mb-4">
            Якщо покупець самостійно збирає меблі, необхідно перевірити всі
            деталі на наявність дефектів (відколів, подряпин). У разі виявлення
            дефекту слід негайно призупинити збірку, остання частина меблів зі
            слідами збірки не підлягає поверненню або обміну. Зберігайте
            фабричну упаковку до завершення збірки, заміна дефектних деталей
            здійснюється тільки для наявності фабричної упаковки
          </p>
          <p className="mb-4">
            Гарантія анулюється, якщо деталь уже була встановлена, або є явні
            ознаки її використання, наприклад, вкручений гвинт чи прорізане
            відвір. У разі виявлення дефекту зв'яжіться з менеджером магазину.
            Зберігайте товарний чек, супровідний документ та маркувальний лист
            на упаковці до завершення гарантійного терміну.
          </p>
          <p className="mb-4">
            Рекламація приймається лише за наявність виробу або його елементів в
            «оригінальній упаковці». У разі недотримання цих вимог, претензії
            щодо рекламацій не приймаються. Рекламації, які виникли через
            неправильну збірку, доставку або експлуатацію, усуваються за рахунок
            покупця. Термін виготовлення рекламних деталей становить близько 20
            робочих днів, але в деяких виробників вдається досягти 30 робочих
            днів.
          </p>
          <p>
            Гарантійні зобов'язання <span className="font-bold">не</span>{" "}
            розширюються, якщо:
          </p>
          <ul className="list-disc ml-5 mb-4">
            <li>порушено правила та умови експлуатації меблів;</li>
            <li>
              встановлення та ремонт меблів використовувалися покупцем
              самостійно;
            </li>
            <li>
              меблі пошкоджені внаслідок дії домашніх тварин, вогню, агресивних
              рідин, а також ознак недбалого поводження з товаром;
            </li>
            <li>змінена конструкція виробу або його комплектуючих покупцем;</li>
            <li>завершився гарантійний термін;</li>
            <li>
              є дефекти, про які було повідомлено покупця до продажу, та за
              наявність яких було надано знижку.
            </li>
          </ul>
        </div>

        <div className="mb-8">
          <h3 className="text-xl font-semibold mb-4">Повернення товару</h3>
          <p className="mb-4">
            Покупець має право протягом 14 днів обмінюватися на аналогічний або
            повернути отриманий товар (меблі), якщо він не підходить за формою,
            кольором, розміром або з інших причин, які заважають використанню
            його за призначенням.
          </p>
          <p>Обмін товару або повернення коштів можливе за умов:</p>
          <ul className="list-disc ml-5 mb-4">
            <li>товар не використовувався і не збиралося;</li>
            <li>
              збережений товарний вигляд, споживчі властивості, фабричні ярлики;
            </li>
            <li>упаковка не пошкоджена;</li>
            <li>є товарний чек, виданий разом з товаром.</li>
          </ul>
          <p>Вам буде відмовлено в заміні товару або коштів, якщо:</p>
          <ul className="list-disc ml-5">
            <li>
              товар виготовлено під індивідуальне замовлення (зокрема, з обраною
              тканиною, нестандартними розмірами, кольорами тощо);
            </li>
            <li>з моменту отримання товару минуло більше 14 днів;</li>
            <li>товар не є новим, тобто був зібраний;</li>
            <li>
              при перевірці якості перевірено ознаки стороннього вручення
              (збірка, монтаж, пошкодження або пошкодження оригінальної
              упаковки).
            </li>
          </ul>
          <p className="mb-4">
            У разі відмови від замовлення покупець сплачує вартість доставки в
            обидва боки.
          </p>
          <p className="mb-4">
            <span className="font-semibold">Увага!</span> Поверненню не
            підлягають товари, виготовлені під індивідуальне замовлення клієнта.
          </p>
          <p>
            Розрахунок з покупцем створюється з вартістю товару на момент
            покупки. У разі неможливості повернути гроші в день повернення
            товару, вартість повертається за домовленістю сторінки, але не
            пізніше ніж через 7 днів.
          </p>
        </div>
      </div>
    </div>
  );
};

export default WarrantyAndReturns;
